content/posts/production_system.md
+++
title = "Production system"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:46+01:00
slug = "production_system"
draft = false
+++

We’ve started to build a simple production system that can be used to
detect errors in subtraction (reimplementing some classic work). We
were thinking that something similar could be used to detect other
kinds of errors (so, for debugging, teaching), and to support other
kinds of reasoning processes (e.g., turning Q’s into A’s in a
question-answering system).

We previously did a little exploratory work, with similar intent, using
polygraphs as input, in the workshop paper
_Modelling the Way Mathematics Is Actually Done_.


## <span class="org-todo todo STARTED">STARTED</span> Reimplementing classic rules to model subtraction {#reimplementing-classic-rules-to-model-subtraction}


## Contributes to {#contributes-to}

-   [Teach basic coding]({{< relref "teach_basic_coding" >}})
-   [Agent model]({{< relref "agent_model" >}})


## Backlinks {#backlinks}

-   [For the sake of advancing AI]({{< relref "for_the_sake_of_advancing_ai" >}})
